// Повний перелік звань ЗСУ
export const MILITARY_RANKS = [
  'Солдат', 'Старший солдат',
  'Молодший сержант', 'Сержант', 'Старший сержант', 'Головний сержант',
  'Штаб-сержант', 'Майстер-сержант', 'Старший майстер-сержант', 'Головний майстер-сержант',
  'Молодший лейтенант', 'Лейтенант', 'Старший лейтенант', 'Капітан',
  'Майор', 'Підполковник', 'Полковник',
  'Бригадний генерал', 'Генерал-майор', 'Генерал-лейтенант', 'Генерал'
];

// Основні посади для твоєї логіки (HRBAC)
export const MILITARY_POSITIONS = [
  'Курсант',
  'Командир відділення',
  'Заступник командира взводу',
  'Командир взводу',
  'Старшина роти',
  'Командир роти',
  'Командир батальйону'
];